In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import os
from math import ceil
from functools import reduce

In [2]:
en=create_engine('postgresql://aaron:123@localhost/ny')
en.connect()

/home/aaron/miniconda/envs/mineria/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [3]:
df = pd.read_sql(con=en,sql="nyc-rolling-sales")
df.head()

,unnamed: 0,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,ease-ment,building_class_at_present,address,...,re_u,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,153 AVENUE B,...,5,0,5,1633,6440,1900,2,C2,6625000,2017-07-19 00:00:00
1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,234 EAST 4TH STREET,...,28,3,31,4616,18690,1900,2,C7,-,2016-12-14 00:00:00
2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,197 EAST 3RD STREET,...,16,1,17,2212,7803,1900,2,C7,-,2016-12-09 00:00:00
3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,154 EAST 7TH STREET,...,10,0,10,2272,6794,1913,2,C4,3936272,2016-09-23 00:00:00
4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,301 EAST 10TH STREET,...,6,0,6,2369,4615,1900,2,C2,8000000,2016-11-17 00:00:00

In [4]:
df.drop(df.columns[[0]], axis=1, inplace=True)
df.drop('ease-ment', axis=1, inplace=True)
df.shape

(84548, 20)

In [5]:
df['sale_date']=pd.to_datetime(df.sale_date)

In [6]:
df[u'año']=df['sale_date'].map(lambda x:x.year)
df[u'mes']=df['sale_date'].map(lambda x:x.month)
df[u'dia']=df['sale_date'].map(lambda x:x.day)

In [7]:
df['Q']=df['mes'].map(lambda x:ceil(x/3))
df['S']=df['mes'].map(lambda x:ceil(x/6))

In [8]:
df.head()

,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,building_class_at_present,address,apartment_number,zip_code,...,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date,año,mes,dia,Q,S
0,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,,10009,...,1900,2,C2,6625000,2017-07-19,2017,7,19,3,2
1,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,C7,234 EAST 4TH STREET,,10009,...,1900,2,C7,-,2016-12-14,2016,12,14,4,2
2,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,C7,197 EAST 3RD STREET,,10009,...,1900,2,C7,-,2016-12-09,2016,12,9,4,2
3,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,,10009,...,1913,2,C4,3936272,2016-09-23,2016,9,23,3,2
4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,,10009,...,1900,2,C2,8000000,2016-11-17,2016,11,17,4,2

In [9]:
lst_dtiempo=['year_built','sale_date','año','mes','dia','Q','S']
td_tiempo=df[lst_dtiempo].copy()
td_tiempo.drop_duplicates(inplace=True)
td_tiempo.shape
td_tiempo.sort_values(['year_built','sale_date'],ascending=[1,1],inplace=True)
td_tiempo.reset_index(drop=True,inplace=True)
td_tiempo['id_tiempo']=td_tiempo.index+1
td_tiempo.head()

   year_built  sale_date   año  mes  dia  Q  S  id_tiempo
0           0 2016-09-01  2016    9    1  3  2          1
1           0 2016-09-02  2016    9    2  3  2          2
2           0 2016-09-05  2016    9    5  3  2          3
3           0 2016-09-06  2016    9    6  3  2          4
4           0 2016-09-07  2016    9    7  3  2          5

In [10]:
df=df.merge(td_tiempo,on=lst_dtiempo,how='inner')
df.drop(lst_dtiempo,axis=1,inplace=True)

In [11]:
df.head()

,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,building_class_at_present,address,apartment_number,zip_code,re_u,commercial_units,total_units,land_square_feet,gross_square_feet,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,id_tiempo
0,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,,10009,5,0,5,1633,6440,2,C2,6625000,1035
1,1,SOHO,13 CONDOS - ELEVATOR APARTMENTS,2,486,1203,R4,57 GREENE STREET,2B,10012,1,0,1,-,-,2,R4,1800000,1035
2,3,BROOKLYN HEIGHTS,10 COOPS - ELEVATOR APARTMENTS,2,247,25,D4,"62 MONTAGUE STREET, 9D",,11201,0,0,0,0,0,2,D4,570000,1035
3,3,BROOKLYN HEIGHTS,14 RENTALS - 4-10 UNIT,2A,216,30,S3,44 HENRY STREET,,11201,3,1,4,1305,3900,2,S3,3550000,1035
4,3,GOWANUS,09 COOPS - WALKUP APARTMENTS,2C,440,43,C6,"509 PRESIDENT STREET, 4R",,11215,0,0,0,0,0,2,C6,449500,1035

In [12]:
lst_dubicacion=['borough','neighborhood','block','lot','address','apartment_number','zip_code']
td_ubica=df[lst_dubicacion].copy()
td_ubica.drop_duplicates(inplace=True)
td_ubica.shape
td_ubica.sort_values(['neighborhood'],ascending=[1],inplace=True)
td_ubica.reset_index(drop=True,inplace=True)
td_ubica['id_ubica']=td_ubica.index+1
td_ubica.head()

,borough,neighborhood,block,lot,address,apartment_number,zip_code,id_ubica
0,4,AIRPORT LA GUARDIA,949,17,1914 81 STREET,,11370,1
1,4,AIRPORT LA GUARDIA,949,67,1949A 80TH STREET,,11370,2
2,4,AIRPORT LA GUARDIA,949,1012,19-45 80TH STREET,2,11370,3
3,4,AIRPORT LA GUARDIA,976,63,21-17 80TH STREET,,11370,4
4,4,AIRPORT LA GUARDIA,949,1001,19-35 80TH STREET,1,11370,5

In [13]:
df=df.merge(td_ubica,on=lst_dubicacion,how='inner')
df.drop(lst_dubicacion,axis=1,inplace=True)

In [14]:
df.shape

(84548, 13)

In [15]:
df.head()

,building-class-category,tax_class_at_present,building_class_at_present,re_u,commercial_units,total_units,land_square_feet,gross_square_feet,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,id_tiempo,id_ubica
0,07 RENTALS - WALKUP APARTMENTS,2A,C2,5,0,5,1633,6440,2,C2,6625000,1035,14
1,13 CONDOS - ELEVATOR APARTMENTS,2,R4,1,0,1,-,-,2,R4,1800000,1035,63741
2,10 COOPS - ELEVATOR APARTMENTS,2,D4,0,0,0,0,0,2,D4,570000,1035,10071
3,14 RENTALS - 4-10 UNIT,2A,S3,3,1,4,1305,3900,2,S3,3550000,1035,10188
4,09 COOPS - WALKUP APARTMENTS,2C,C6,0,0,0,0,0,2,C6,449500,1035,32327

In [16]:
lst_dtcons=['building-class-category','building_class_at_present','building_class_at_time_of_sale']
td_tcons=df[lst_dtcons].copy()
td_tcons.drop_duplicates(inplace=True)
td_tcons.shape
td_tcons.sort_values(['building-class-category','building_class_at_present','building_class_at_time_of_sale'],ascending=[1,1,1],inplace=True)
td_tcons.reset_index(drop=True,inplace=True)
td_tcons['id_cons']=td_tcons.index+1
td_tcons.head()

,building-class-category,building_class_at_present,building_class_at_time_of_sale,id_cons
0,01 ONE FAMILY DWELLINGS,,A5,1
1,01 ONE FAMILY DWELLINGS,A0,A0,2
2,01 ONE FAMILY DWELLINGS,A0,A2,3
3,01 ONE FAMILY DWELLINGS,A0,A9,4
4,01 ONE FAMILY DWELLINGS,A1,A1,5

In [17]:
df=df.merge(td_tcons,on=lst_dtcons,how='inner')
df.drop(lst_dtcons,axis=1,inplace=True)

In [18]:
df.shape

(84548, 11)

In [19]:
df.head()

,tax_class_at_present,re_u,commercial_units,total_units,land_square_feet,gross_square_feet,tax_class_at_time_of_sale,sale_price,id_tiempo,id_ubica,id_cons
0,2A,5,0,5,1633,6440,2,6625000,1035,14,97
1,2A,6,0,6,2369,4615,2,8000000,862,170,97
2,2A,6,0,6,2500,4500,2,0,3069,78201,97
3,2A,5,0,5,2100,4560,2,3782000,3261,54962,97
4,2A,6,0,6,2863,5000,2,4750000,3330,78180,97

In [20]:
lst_dimpu=['tax_class_at_present','tax_class_at_time_of_sale']
td_impu=df[lst_dimpu].copy()
td_impu.drop_duplicates(inplace=True)
td_impu.shape
td_impu.sort_values(['tax_class_at_present','tax_class_at_time_of_sale'],ascending=[1,1],inplace=True)
td_impu.reset_index(drop=True,inplace=True)
td_impu['id_impu']=td_impu.index+1
td_impu.head()

  tax_class_at_present  tax_class_at_time_of_sale  id_impu
0                                               1        1
1                                               2        2
2                                               4        3
3                    1                          1        4
4                    1                          2        5

In [21]:
df=df.merge(td_impu,on=lst_dimpu,how='inner')
df.drop(lst_dimpu,axis=1,inplace=True)

In [22]:
df.shape

(84548, 10)

In [23]:
df.head()

,re_u,commercial_units,total_units,land_square_feet,gross_square_feet,sale_price,id_tiempo,id_ubica,id_cons,id_impu
0,5,0,5,1633,6440,6625000,1035,14,97,15
1,6,0,6,2369,4615,8000000,862,170,97,15
2,6,0,6,2500,4500,0,3069,78201,97,15
3,5,0,5,2100,4560,3782000,3261,54962,97,15
4,6,0,6,2863,5000,4750000,3330,78180,97,15

In [24]:
df=df[['re_u','commercial_units','land_square_feet','gross_square_feet','sale_price','id_tiempo','id_ubica','id_cons','id_impu']]

In [25]:
df.head()

,re_u,commercial_units,land_square_feet,gross_square_feet,sale_price,id_tiempo,id_ubica,id_cons,id_impu
0,5,0,1633,6440,6625000,1035,14,97,15
1,6,0,2369,4615,8000000,862,170,97,15
2,6,0,2500,4500,0,3069,78201,97,15
3,5,0,2100,4560,3782000,3261,54962,97,15
4,6,0,2863,5000,4750000,3330,78180,97,15

In [26]:
def trns(x):
    if x.isdigit()==True:
        return int(x)
    else:
        return 0

In [27]:
df['land_square_feet']= df['land_square_feet'].map(lambda x:trns(x))
df['gross_square_feet']= df['gross_square_feet'].map(lambda x:trns(x))
df['sale_price']= df['sale_price'].map(lambda x:trns(x))
df.head()

,re_u,commercial_units,land_square_feet,gross_square_feet,sale_price,id_tiempo,id_ubica,id_cons,id_impu
0,5,0,1633,6440,6625000,1035,14,97,15
1,6,0,2369,4615,8000000,862,170,97,15
2,6,0,2500,4500,0,3069,78201,97,15
3,5,0,2100,4560,3782000,3261,54962,97,15
4,6,0,2863,5000,4750000,3330,78180,97,15

In [28]:
aux=df.pivot_table(index=['re_u','commercial_units','id_tiempo','id_ubica','id_cons','id_impu'], values=['sale_price'],aggfunc=[np.sum],fill_value=0)

In [29]:
aux.reset_index(inplace=True)

In [30]:
aux.shape

(83120, 7)

In [31]:
aux.head()

  re_u commercial_units id_tiempo id_ubica id_cons id_impu        sum
                                                           sale_price
0    0                0         1     9315      85       8    1100000
1    0                0         1     9317      85       8          0
2    0                0         1    19829     222      24     700000
3    0                0         1    19831     222      24     850000
4    0                0         1    19833     222      24     850000

In [35]:
aux.columns = [f'{i}_{j}' if j != '' else f'{i}' for i,j in aux.columns]

In [36]:
aux.head()

,re_u,commercial_units,id_tiempo,id_ubica,id_cons,id_impu,sum_sale_price
0,0,0,1,9315,85,8,1100000
1,0,0,1,9317,85,8,0
2,0,0,1,19829,222,24,700000
3,0,0,1,19831,222,24,850000
4,0,0,1,19833,222,24,850000

In [37]:
th_precios=aux.copy()

In [38]:
en_bi=create_engine('postgresql://aaron:123@localhost/nybi')
en_bi.connect()

In [39]:
%%time
for t in ['td_tiempo','td_ubica','td_tcons','td_impu','th_precios']:
    locals()[t].to_sql(con=en_bi,index=False,
                       if_exists='replace',
                       name=t,
                       chunksize=100000)

CPU times: user 48.7 s, sys: 10.6 s, total: 59.3 s
Wall time: 1min 57s

In [40]:
query='''
select A."sum_sale_price",B.* 
from th_precios A inner join td_tiempo B 
on A.id_tiempo=B.id_tiempo;
'''

In [41]:
qf = pd.read_sql(con=en_bi,sql=query)

In [42]:
qf.shape

(83120, 9)

In [43]:
qf.head()

   sum_sale_price  year_built  sale_date   año  mes  dia  Q  S  id_tiempo
0         1100000           0 2016-09-01  2016    9    1  3  2          1
1               0           0 2016-09-01  2016    9    1  3  2          1
2          700000           0 2016-09-01  2016    9    1  3  2          1
3          850000           0 2016-09-01  2016    9    1  3  2          1
4          850000           0 2016-09-01  2016    9    1  3  2          1